{
  "education": [
    {
      "awards_achievements": [
        "Dean's Renewable Entrance Scholarship (2016, 2021): Maintained an average \u003e80% ",
        "Dean's List (2016, 2021): Maintained an average \u003e80% ",
        "GPA: 3.3/4.0"
      ],
      "degree": "B.C.S. Honours Computer Science Co-Op with Minor in Mathematics",
      "department": "Computer Science",
      "duration": "2016-2021",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-shahiro770",
  "highlighted_projects": [
    {
      "description": "Developed a two-dimensional roguelike turn-based adventure game in C# and Unity, similar to games such as The Oregon Trail. The game features hand-drawn pixel art, as well as usage of various post-processing effects to provide an immersive experience.",
      "git_url": "https://github.com/shahiro770/CandleLight",
      "name": "CandleLight"
    },
    {
      "description": "Created a space invaders style, top down shooting game, using Java and the GUI library Swing. The game makes use of basic OOP design principles to efficiently handle the movement and interactions of the player, enemies, and barricades.",
      "git_url": "https://github.com/shahiro770/space-invaders",
      "name": "Space Invaders"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a monitoring agent to collect real-time resource usage of nodes in a Linux cluster using, using Bash shell script. The results are stored in a relational database via PostgreSQL, where they can be queried for analysis.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Shahir Chowdhury",
  "others": [
    {
      "bullets": [
        "Weightlifting",
        "Video Gaming",
        "Running"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Training to be a technical consultant, learning the latest in industry standard technologies and best practices. Currently have learned the fundamentals of shell scripting in Bash, as well as working with Linux and PostgreSQL as well as having used the technologies to develop a Linux cluster monitoring agent.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Amazon",
      "description": "Worked on the new platform, Send To Amazon (STA), developing the new workflow through which sellers create shipments for products, receive estimates for delivery, and ultimately schedule shipment transportation. Primarily used TypeScript and ReactJS for frontend related work, and Java and Spring for backend related API development and event orchestration.",
      "duration": "2021-2022",
      "title": "Software Development Engineer I"
    },
    {
      "company": "IBM",
      "description": "Developed tools with ReactJS and Javascript for the redesign of SPSS Statistics, a statistical analysis and data preparation application. This work involved utilizing various frontend spread-sheeting libraries, such as Handsontable and Ag-grid, for creating performant spreadsheets for displaying and modifying data.",
      "duration": "2018-2019",
      "title": "Software Developer"
    },
    {
      "company": "University of Windsor",
      "description": "Assisted computer science students with learning fundamental discrete math concepts, the basics of C, data structures, and computational theory. I also evaluated weekly assignments and tests, while carrying out exam related duties such as proctoring and marking.",
      "duration": "2017-2020",
      "title": "Teaching Assistant"
    }
  ],
  "skills": {
    "competent": [
      "C#",
      "Python",
      "Redux",
      "TypeScript",
      "SQL"
    ],
    "familiar": [
      "Bash",
      "AWS",
      "Node.js",
      "GraphQL",
      "C/C++"
    ],
    "proficient": [
      "Java",
      "JavaScript",
      "ReactJS",
      "Agile/Scrum",
      "Git",
      "Unity"
    ]
  },
  "summary": "Hi, my name is Shahir. I studied at the University of Windsor, where I completed my bachelor's degree in computer science and graduated with a cumulative GPA of 3.3/4.0 and a major GPA of 3.7/4.0. During my time at the university, I interned for 16 months at IBM. While there, I primarily worked as a frontend developer, implementing UI features and workflows on SPSS Statistics, a statistical analysis application. Upon graduating, I worked for a year at Amazon on the operations side. My work was mainly focused on maintaining and updating services related to workflows sellers would use for inbounding their goods to Amazon Fulfillment Centers. I find learning to be a very fun process, which is why I think I enjoyed my time at IBM and Amazon with all of the opportunities they presented to dive deep into technologies I wasn't familiar with. I prioritize personal growth more than anything and am eagerly looking for opportunities to improve my skills as a software developer. If given the chance, I will do everything I can to deliver on any set of expectations. Outside of work, I enjoy going to the gym and playing video games. I hope you enjoy reading my profile."
}
